W7/D5/RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Subscribe"], ["description", "afdsfds"], ["moderator_id", 1], ["created_at", "2021-10-15 23:46:23.404873"], ["updated_at", "2021-10-15 23:46:23.404873"]]
---
  def create
    @sub = Sub.new(sub_params)
    if @sub.save