W7/D5/RedditClone/app/models/user.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "zuEPyWYF6DqUP5lO9Tk8Wg"], ["updated_at", "2021-10-15 22:18:14.678117"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!