W11D2/TodoApp/app/controllers/api/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    todos = Todo.all

INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "This is fifth "], ["body", "safadsf"], ["done", false], ["created_at", "2021-11-12 00:36:14.247666"], ["updated_at", "2021-11-12 00:36:14.247666"]]
---
  def create
    todo = Todo.new(todo_params)
    if todo.save